kepler-444b/GD_gd32e230c8t6/Source/device/panel_key.c
static void process_cmd_check(valid_data_t *data, const panel_cfg_t *temp_cfg, panel_status_t *temp_status)
{
    switch (data->data[1]) {
        case ALL_CLOSE: { // 总关
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                if ((BIT5(temp_cfg[i].perm) == true) && // "睡眠"被勾选,"总开关分区"相同 或 0xF
                    ((H_BIT(data->data[4]) == H_BIT(temp_cfg[i].area)) || (H_BIT(data->data[4]) == 0xF))) {
                    switch (temp_cfg[i].func) {
                        case ALL_CLOSE:
                            if (data->data[3] == temp_cfg[i].group) {
                                panel_fast_exe(&temp_status[i], (0b00011010 & ~0x01) | (data->data[2] & 0x01));
                            }
                            break;
                        case NIGHT_LIGHT:
                        case DND_MODE:
                            panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | (data->data[2] & 0x01));
                            break;
                        case SCENE_MODE:
                        case LIGHT_MODE:
                        case ALL_ON_OFF:
                        case CLEAN_ROOM:
                            panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | 0x00);
                            break;
                        default:
                            break;
                    }
                }
            }
        } break;
        case ALL_ON_OFF: { // 总开关
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                if ((BIT5(temp_cfg[i].perm) == true) && // "总开关"被勾选,"总开关分区"相同 或 0xF
                    ((H_BIT(data->data[4]) == H_BIT(temp_cfg[i].area)) || (H_BIT(data->data[4]) == 0xF))) {
                    switch (temp_cfg[i].func) {
                        case ALL_ON_OFF:
                            if (data->data[3] == temp_cfg[i].group) {
                                panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | (data->data[2] & 0x01));
                            }
                            break;
                        case NIGHT_LIGHT:
                        case DND_MODE:
                            panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | (~data->data[2] & 0x01));
                            break;
                        case SCENE_MODE:
                        case LIGHT_MODE:
                        case CLEAN_ROOM:
                            panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | (data->data[2] & 0x01));
                            break;
                        case ALL_CLOSE:
                            panel_fast_exe(&temp_status[i], (0b00011010 & ~0x01) | (data->data[2] & 0x01));
                            break;
                        default:
                            break;
                    }
                }
            }
        } break;
        case CLEAN_ROOM: { // 清理房间
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                if (temp_cfg[i].func == CLEAN_ROOM &&
                    (data->data[3] == temp_cfg[i].group || data->data[3] == 0xFF)) {
                    if (data->data[2] == true) {
                        for (uint8_t j = 0; j < KEY_NUMBER; j++) {
                            if (temp_cfg[j].func == DND_MODE &&
                                (data->data[3] == temp_cfg[j].group || data->data[3] == 0xFF)) {
                                panel_fast_exe(&temp_status[j], (0b00010110 & ~0x01) | (~data->data[2] & 0x01));
                            }
                        }
                    }
                    panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | (data->data[2] & 0x01));
                }
            }
        } break;
        case DND_MODE: { // 勿扰模式
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                if (temp_cfg[i].func == DND_MODE &&
                    (data->data[3] == temp_cfg[i].group || data->data[3] == 0xFF)) {
                    if (data->data[2] == true) {
                        for (uint8_t j = 0; j < KEY_NUMBER; j++) {
                            if (temp_cfg[j].func == CLEAN_ROOM &&
                                (data->data[3] == temp_cfg[j].group || data->data[3] == 0xFF)) {
                                panel_fast_exe(&temp_status[j], (0b00010110 & ~0x01) | (~data->data[2] & 0x01));
                            }
                        }
                    }
                    panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | (data->data[2] & 0x01));
                }
            }
        } break;
        case LATER_MODE: { // 请稍后
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                if (temp_cfg[i].func == LATER_MODE &&
                    (data->data[3] == temp_cfg[i].group || data->data[3] == 0xFF)) {
                    panel_fast_exe(&temp_status[i], (0b00100110 & ~0x01) | (data->data[2] & 0x01));
                }
            }
        } break;
        case CHECK_OUT: { // 退房
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                if (temp_cfg[i].func == CHECK_OUT &&
                    (data->data[3] == temp_cfg[i].group || data->data[3] == 0xFF)) {
                    panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | (data->data[2] & 0x01));
                }
            }
        } break;
        case SOS_MODE: { // 紧急呼叫
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                if (temp_cfg[i].func == SOS_MODE &&
                    (data->data[3] == temp_cfg[i].group || data->data[3] == 0xFF)) {
                    panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | (data->data[2] & 0x01));
                }
            }
        } break;
        case SERVICE: { // 请求服务
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                if (temp_cfg[i].func == SERVICE &&
                    (data->data[3] == temp_cfg[i].group || data->data[3] == 0xFF)) {
                    panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | (data->data[2] & 0x01));
                }
            }
        } break;
        case CURTAIN_OPEN: { // 窗帘开
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                if (temp_cfg[i].func == CURTAIN_OPEN &&
                    (data->data[3] == temp_cfg[i].group || data->data[3] == 0xFF)) {
                    for (uint8_t j = 0; j < KEY_NUMBER; j++) { // 先关闭同分组的"窗帘关"
                        if (temp_cfg[j].func == CURTAIN_CLOSE &&
                            (data->data[3] == temp_cfg[j].group || data->data[3] == 0xFF)) {
                            panel_fast_exe(&temp_status[j], (0b00110000 & ~0x01) | 0x00);
                        }
                    }
                    panel_fast_exe(&temp_status[i], (0b00101010 & ~0x01) | 0x01);
                }
            }
        } break;
        case CURTAIN_CLOSE: { // 窗帘关
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                if (temp_cfg[i].func == CURTAIN_CLOSE &&
                    (data->data[3] == temp_cfg[i].group || data->data[3] == 0xFF)) {
                    for (uint8_t j = 0; j < KEY_NUMBER; j++) { // 先关闭同分组的"窗帘开"
                        if (temp_cfg[j].func == CURTAIN_OPEN &&
                            (data->data[3] == temp_cfg[j].group || data->data[3] == 0xFF)) {
                            panel_fast_exe(&temp_status[j], (0b00110000 & ~0x01) | 0x00);
                        }
                    }
                    panel_fast_exe(&temp_status[i], (0b00101010 & ~0x01) | 0x01);
                }
            }
        } break;
        case SCENE_MODE: { // 场景模式
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                if ((temp_cfg[i].scene_group != 0x00) && // 屏蔽掉没有勾选任何场景分组的按键
                    ((L_BIT(data->data[4]) == L_BIT(temp_cfg[i].area)) || (L_BIT(data->data[4]) == 0xF))) {

                    panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | 0x00); // 先关闭该场景区域的所有分组
                    uint8_t mask = data->data[7] & temp_cfg[i].scene_group;       // 找出两个字节中同为1的位
                    if (mask != 0) {                                              // 任意一位同为1,说明勾选了该场景分组,执行动作
                        panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | (data->data[2] & 0x01));
                    }
                }
            }
        } break;
        case LIGHT_MODE: { // 灯控模式
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                    if (temp_cfg[i].func == LIGHT_MODE &&
                        (data->data[3] == temp_cfg[i].group || data->data[3] == 0xFF)) {
                        panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | (data->data[2] & 0x01));
                    }
                }
            }
        } break;
        case NIGHT_LIGHT: { // 夜灯
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                if (temp_cfg[i].func == NIGHT_LIGHT &&
                    (data->data[3] == temp_cfg[i].group || data->data[3] == 0xFF)) {
                    panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | (data->data[2] & 0x01));
                }
            }
        } break;
        case LIGHT_UP:
            break;
        case LIGHT_DOWN:
            break;
        case DIMMING_3:
            break;
        case DIMMING_4:
            break;
        case UNLOCKING:
            break;
        case BLUETOOTH:
            break;
        case CURTAIN_STOP: { // 窗帘停
            for (uint8_t i = 0; i < KEY_NUMBER; i++) {
                if (((temp_cfg[i].func == CURTAIN_OPEN) || (temp_cfg[i].func == CURTAIN_CLOSE)) &&
                    (data->data[3] == temp_cfg[i].group || data->data[3] == 0xFF) &&
                    temp_status[i].relay_short == true) {
                    panel_fast_exe(&temp_status[i], (0b00111010 & ~0x01) | 0x00);
                }
            }
        } break;
        case VOLUME_ADD:
            break;
        case VOLUME_SUB:
            break;
        case PLAY_PAUSE:
            break;
        case NEXT_SONG:
            break;
        case LAST_SONG:
            break;
        default:
            return;
    }
}

